Tekla Open API Reference for Tekla Structures 2025
GridCylindricalSurface Properties
The GridCylindricalSurface type exposes the following members.
Properties
Name | Description
CylinderBase
 The arc that represents the base of the cylindrical surface. The cylinder is then extruded along the normal direction of the arc, with the height given by CylinderHeight"
CylinderHeight
 Height of the cylinder along the normal direction of the CylinderBase arc.
DrawingVisibility
 The visibility of the grid surface in drawings.
 (Inherited from GridSurface.)
ExtensionAbove
 The line extension above.
 (Inherited from GridSurface.)
ExtensionBelow
 The line extension below.
 (Inherited from GridSurface.)
ExtensionLeft
 The line extension on the left.
 (Inherited from GridSurface.)
ExtensionRight
 The line extension on the right.
 (Inherited from GridSurface.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsMagnetic
 Whether the grid surface is magnetic or not.
 (Inherited from GridSurface.)
IsManual
 Gets or sets if the line was manually created.
 (Inherited from GridSurface.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Label
 The label for the grid surface.
 (Inherited from GridSurface.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Parent
 The parent grid of the grid surface.
 (Inherited from GridSurface.)
Top
See Also
Reference
GridCylindricalSurface Class
Tekla.Structures.Model Namespace